Revit 2026 API

# LayoutRuleMaximumSpacing Constructor

---

Constructor of LayoutRuleMaximumSpacing.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public LayoutRuleMaximumSpacing(
	double spacing
)
```
```vb
Public Sub New (
	spacing As Double
)
```
```cpp
public:
LayoutRuleMaximumSpacing(
	double spacing
)
```
```fsharp
new :
        spacing : float -> LayoutRuleMaximumSpacing
```

#### Parameters

spacing Double
     The value of spacing must be in (0, 30000).

The value of spacing must be in (0, 30000), but in fact the spacing should not be too small or too great.

#### Reference

LayoutRuleMaximumSpacing Class

Autodesk.Revit.DB Namespace